sc750/esp32-p4-live2d-companion/sdkconfig.defaults
# ESP-IDF 5.5.4 配置（基于能用的 esp_brookesia_phone）
CONFIG_IDF_TARGET="esp32p4"

# === Flash ===
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# === 编译 ===
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y

# === PSRAM（与能用的固件一致）===
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# === Cache ===
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# === 系统 ===
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_FATFS_LFN_HEAP=y
# 注：CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM 本版 esp_hosted(3.0.2) 无此符号，
# 写了也是死配置（生成的 sdkconfig 里根本不出现），已于 2026-09-10 删除。
# 真正管 SDIO 收发缓冲落哪块堆的开关在 port/Kconfig.ext，见下方 ESP-Hosted 段。
# main 任务栈：默认 3584B 在 Phase4（SD/FATFS 挂载 + 长中文日志）下实测溢出
# （Guru Meditation: Stack protection fault，SP 低于栈下界），放大到 8KB。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# === BSP 显示 ===
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_USE_DMA2D=y
CONFIG_BSP_LCD_TYPE_1024_600=y
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL=y

# === 摄像头（SC2336 MIPI-CSI，对齐官方 esp_brookesia_phone）===
CONFIG_CAMERA_SC2336=y
CONFIG_CAMERA_SC2336_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_SC2336_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS=y
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=n
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# === Wi-Fi Remote（ESP32-C6 远端 Wi-Fi）===
CONFIG_ESP_HOSTED_CP_TARGET_FROM_WIFI_REMOTE=y

# === LVGL ===
CONFIG_LV_COLOR_SCREEN_TRANSP=y
# 注：CONFIG_LV_MEM_CUSTOM 是 LVGL v8 的开关，v9 已删除——写了同样不生效，
# 结果 LVGL 仍用内建 TLSF，64KB 池固化成内部 SRAM 的 .bss.work_mem_int.0
# （map 实测 0x10000=65536B），挤压 esp_hosted 的 SDIO 缓冲。已删。
# v9 对应写法是 LV_USE_STDLIB_MALLOC 三选一，这里选 CLIB：
# 让 LVGL 的内存走 IDF 堆，>16KB 的大块按 CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL
# 自动落到 PSRAM，内部 SRAM 不再被固定预留 64KB。
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=15
CONFIG_LV_CIRCLE_CACHE_SIZE=10
CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=102400
CONFIG_LV_IMG_CACHE_DEF_SIZE=20
CONFIG_LV_GRAD_CACHE_DEF_SIZE=10240
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y

# === ESP-Hosted Wi-Fi ===
CONFIG_ESP_HOSTED=y
CONFIG_ESP_HOSTED_HOST=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_HOST_TYPE_MCU=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_HOST_CORE=y
CONFIG_ESP_HOSTED_HOST_CORE_READY=y
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=6144
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_ESP_HOSTED_HOST_SDIO_TX_Q_SIZE=10
CONFIG_ESP_HOSTED_HOST_SDIO_RX_Q_SIZE=10
# 注（2026-09-10 实测证伪）：曾想开 CONFIG_EH_HOST_PORT_DMA_PREFER_SPIRAM
# 把 SDIO 收发缓冲挪到 PSRAM，但本工程 IDF 5.5.4 / ESP32-P4 上不成立——
# esp_psram_extram_add_to_heap_allocator() 给 PSRAM 堆注册的 caps 只有
# {MALLOC_CAP_SPIRAM|MALLOC_CAP_DEFAULT, 0, MALLOC_CAP_8BIT|32BIT|SIMD}，
# 不含 MALLOC_CAP_DMA，所以 heap_caps_aligned_alloc(MALLOC_CAP_SPIRAM|
# MALLOC_CAP_DMA, …) 恒返回 NULL（板子上打印 "PSRAM-DMA堆: 空闲=0KB"），
# 该开关开了也是死配置。真正管用的是"把内部 SRAM 静态占用腾出来"，
# 见下方 LVGL 段 —— 那次改动让 .dram0.bss 从 113KB 降到 47.5KB。

# === 日志 ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# === 实验性功能 ===
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# 控制台主通道 = 内置 USB-Serial-JTAG（用户的线插的就是它；UART0 未接 PC）
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# PSRAM malloc 路由：>16KB 的大分配自动走 PSRAM（cJSON 解析大 TTS 响应必需）
CONFIG_SPIRAM_USE_MALLOC=y
